app/views/posts/index.html.erb

SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8
---
<!-- new code starts here
<% if !params[:author].blank? %>
  <% @posts = Post.where(author: params[:author]) %> -->