app/controllers/posts_controller.rb

  def index
    # provide a list of authors to the view for the filter control
    @authors = Author.all

    # filter the @posts list based on user input
    if !params[:author].blank?
      @posts = Post.by_author(params[:author])
      # @posts = Post.where(author: params[:author])
      # moved to parts of it to def self.by_author app/models/post.rb
    elsif !params[:date].blank?
      if params[:date] == "Today"
        @posts = Post.from_today
        # @posts = Post.where("created_at >=?", Time.zone.today.beginning_of_day)
        # moved to def self.from_today app/models/post.rb
      else
        @posts = Post.old_news
        # @posts = Post.where("created_at <?", Time.zone.today.beginning_of_day)
        # moved to def self.old_news app/models/post.rb
      end
    else
      # if no filters are applied, show all posts
      @posts = Post.all
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')